export const phoneLengths = {
  // ---------------- الدول العربية ----------------
  SY: 9, // سوريا
  EG: 10, // مصر
  SA: 9, // السعودية
  JO: 9, // الأردن
  AE: 9, // الإمارات
  LB: 8, // لبنان
  IQ: 10, // العراق
  PS: 9, // فلسطين
  DZ: 9, // الجزائر
  MA: 9, // المغرب
  TN: 8, // تونس
  LY: 9, // ليبيا
  BH: 8, // البحرين
  KW: 8, // الكويت
  OM: 8, // عمان
  QA: 8, // قطر
  YE: 9, // اليمن
  SD: 9, // السودان
  MR: 8, // موريتانيا
  SO: 9, // الصومال
  DJ: 8, // جيبوتي
  KM: 7, // جزر القمر

  // ---------------- دول أخرى ----------------
  TR: 10, // تركيا
  IR: 10, // إيران
  AF: 9, // أفغانستان
  PK: 10, // باكستان
  IN: 10, // الهند
  BD: 10, // بنغلادش
  NP: 10, // نيبال
  LK: 9, // سريلانكا
  PH: 10, // الفلبين
  TH: 9, // تايلاند
  MY: 9, // ماليزيا
  ID: 10, // إندونيسيا
  CN: 11, // الصين
  JP: 10, // اليابان
  KR: 10, // كوريا الجنوبية

  // ---------------- أوروبا ----------------
  DE: 11, // ألمانيا
  FR: 9, // فرنسا
  IT: 10, // إيطاليا
  ES: 9, // إسبانيا
  GB: 10, // بريطانيا
  RU: 10, // روسيا
  UA: 9, // أوكرانيا

  // ---------------- أفريقيا ----------------
  NG: 10, // نيجيريا
  GH: 9, // غانا
  KE: 10, // كينيا
  TZ: 9, // تنزانيا
  ZA: 9, // جنوب أفريقيا

  // ---------------- أمريكا ----------------
  US: 10, // الولايات المتحدة
  CA: 10, // كندا
  BR: 11, // البرازيل
  MX: 10, // المكسيك
  AR: 10, // الأرجنتين
  CL: 9, // تشيلي
  CO: 10, // كولومبيا
  VE: 10, // فنزويلا
};
